const productCatalogRamps= [  
  {id: 1,
    name: "ramp60",
    image: "/images/ramps/minir180h60w200d40alt.png",
    altImages: ["/images/ramps/webp/minir180h60w200d40.webp", "/images/ramps/webp/minir180h60w200d40frontalt.webp",  "/images/ramps/webp/minir180h60w200d40top.webp",  "/images/ramps/webp/minir180h60w200d40front.webp"],
    sampleImages: ["/images/sample1.jpg", "/images/sample2.jpg", "/images/sample3.jpg" ],
    designer: "Studio 65",
    year: 2023,
    // description: "Цена на рампу зависит от размеров конструкции и количества материалов варьируется от ..  Чтобы узнать точную стоимость, свяжитесь с нами любым удобным способом — по телефону, в мессенджерах или через форму обратной связи на сайте. Мы подробно проконсультируем и подготовим предложение под ваши задачи.",
     description:"Пиши нам у месенджер або кидай заявку — ми зателефонуємо і все обговоримо. Рампи робимо під замовлення, бо кожна — це серйозна штука, яку не штампуємо на потік. Якість, міцність, любов до деталей. Доставка по Україні туди, де ти збираєш свій скейтпарк.",
    description2: "міні-рампа для скейтпарку висотою 60 см - відмінне рішення для дітей, райдерів-початківців і тренувань в обмеженому просторі. Завдяки невеликій висоті ця скейт-фігура безпечна та зручна для відпрацювання перших трюків на скейтборді, BMX або трюковому самокаті. Купити міні-рампу 60 см можна для двору, шкільного майданчика або навіть критої зони, горища, гаража — компактний розмір і міцна конструкція гарантують довговічність і комфортне катання." ,  
    //  description3: "комплекты для самостоятельного строительства элементов.",
    details: [
      { title: "kаталог фигур", link: "#catalog" },
      // { title: "Материалы", link: "#materials" },
      // { title: "Технические характеристики", link: "#tech-specs" },
      // { title: "Доставка", link: "#delivery" },
      // { title: "Установка", link: "#installation" }
    ],
    relatedProducts: [2, 3, 4] // IDs of related products
  },
{
    id: 2,
    name: "ramp95",
    image: "/images/ramps/webp/ramp95garagemain.webp",
    altImages: ["/images/ramps/webp/ramp95garagetop.webp", "/images/ramps/webp/ramp95garage.webp"],
    sampleImages: ["/images/sample1.jpg", "/images/sample2.jpg", "/images/sample3.jpg" ],
    designer: "РампСтрой",
    year: 2024,
    // description: "Чтобы узнать точную стоимость, свяжитесь с нами любым удобным способом — по телефону, в мессенджерах или через форму обратной связи на сайте. Мы подробно проконсультируем и подготовим предложение под ваши задачи.",
     description:"Пиши нам у месенджер або кидай заявку — ми зателефонуємо і все обговоримо. Рампи робимо під замовлення, бо кожна — це серйозна штука, яку не штампуємо на потік. Якість, міцність, любов до деталей. Доставка по Україні туди, де ти збираєш свій скейтпарк.",
    description2: "міні-рампа для скейтпарку висотою 95 см і шириною 2.5 м - ідеальне рішення для райдерів-початківців і приватних майданчиків. Компактна скейт-фігура відмінно підійде для скейтбордів, BMX та трюкових самокатів. Купити міні-рампу такого розміру можна для дому чи двору – вона допоможе освоїти базові трюки та зробить катання безпечним та захоплюючим.",
    //  description3: "комплекты для самостоятельного строительства элементов.",
    details: [
      { title: "kаталог фигур", link: "#catalog" },
      // { title: "Материалы", link: "#materials" },
      // { title: "Размеры", link: "#dimensions" },
      // { title: "Установка", link: "#installation" },
      // { title: "Гарантия", link: "#warranty" }
    ],
    relatedProducts: [1, 3, 4] // IDs of related products
  }, 
  {
    id: 3,
    name: "ramp125",
       image: "/images/ramps/webp/rampr250h125w375d125.webp",
    altImages: ["/images/ramps/webp/rampr250h125w375d125top.webp", "/images/ramps/webp/rampr250h125w375d125front.webp"],
    sampleImages: ["/images/sample1.jpg", "/images/sample2.jpg", "/images/sample3.jpg" ],
    designer: "СкейтДизайн",
    year: 2024,
    // description: "Чтобы узнать точную стоимость, свяжитесь с нами любым удобным способом — по телефону, в мессенджерах или через форму обратной связи на сайте. Мы подробно проконсультируем и подготовим предложение под ваши задачи.",
     description: "Пиши нам у месенджер або кидай заявку — ми зателефонуємо і все обговоримо. Рампи робимо під замовлення, бо кожна — це серйозна штука, яку не штампуємо на потік. Якість, міцність, любов до деталей. Доставка по Україні туди, де ти збираєш свій скейтпарк.",
    description2: "рампа для скейтпарку висотою 1.25 м та шириною 3.75 м — універсальний варіант для міських скейт-зон та спортивних майданчиків. Ця середня рампа підійде для катання на скейтборді, BMX та самокаті. Купити рампу такого розміру варто тим, хто хоче розвиватися та вчитися виконувати складніші трюки у зручних та безпечних умовах."  ,
      // description3: "комплекты для самостоятельного строительства элементов.",
    details: [
        { title: "kаталог фигур", link: "#catalog" },
      // { title: "kаталог фигур", link: "#catalog" },
      // { title: "Варианты комплектации", link: "#sets" },
      // { title: "Технические характеристики", link: "#tech-specs" },
      // { title: "Доставка", link: "#delivery" }
    ],
    relatedProducts: [1, 2, 4] // IDs of related products
  },
  {
    id: 4,
    name: "ramp125",
     image: "/images/ramps/webp/rampskl.webp",
    altImages: ["/images/ramps/webp/rampsklfront.webp", "/images/ramps/webp/rampskltop.webp"],
sampleImages: ["/images/sample1.jpg", "/images/sample2.jpg", "/images/sample3.jpg" ],
    designer: "DIY Workshop",
    year: 2023,
    // description: "усиленная конструкция для большого потока людей если фигура стоит в публичном проходном месте то мы рекомендуем экстра версию (слой )Чтобы узнать точную стоимость, свяжитесь с нами любым удобным способом — по телефону, в мессенджерах или через форму обратной связи на сайте. Мы подробно проконсультируем и подготовим предложение под ваши задачи.",
     
    description:"Пиши нам у месенджер або кидай заявку — ми зателефонуємо і все обговоримо. Рампи робимо під замовлення, бо кожна — це серйозна штука, яку не штампуємо на потік. Якість, міцність, любов до деталей. Доставка по Україні туди, де ти збираєш свій скейтпарк.",
    description2: "професійна рампа для скейтпарку висотою 1.25 м та шириною 5 м – це вибір екстремалів та спортивних клубів. Велика скейт-фігура ідеально підійде для змагань та тренувань професійних райдерів. Купити рампу 2 м можна для відкритих скейтпарків, щоб залучити досвідчених спортсменів та створити справжню атмосферу екстриму.",
    //  description3: "придбати рампу ви можете написавши нам у месенджері або залишивши заявку і ми зв'яжемося з вами",
    details: [
      { title: "kаталог фигур", link: "#catalog" },
      // { title: "Инструкции", link: "#instructions" },
      // { title: "Материалы", link: "#materials" },
      // { title: "Инструменты", link: "#tools" },
      // { title: "Советы", link: "#tips" }
    ],
    relatedProducts: [1, 2, 3] // IDs of related products
  }, 
   {
    id: 5,
    name: "ramp180",
     image: "/images/ramps/webp/midiramp.webp",
    altImages: ["/images/ramps/webp/midiramptop.webp", "/images/ramps/webp/midirampfront.webp"],
sampleImages: ["/images/sample1.jpg", "/images/sample2.jpg", "/images/sample3.jpg" ],
    designer: "DIY Workshop",
    year: 2023,
   description:"Пиши нам у месенджер або кидай заявку — ми зателефонуємо і все обговоримо. Рампи робимо під замовлення, бо кожна — це серйозна штука, яку не штампуємо на потік. Якість, міцність, любов до деталей. Доставка по Україні туди, де ти збираєш свій скейтпарк.",
    description2: "професійна рампа для скейтпарку висотою 1.25 м та шириною 5 м – це вибір екстремалів та спортивних клубів. Велика скейт-фігура ідеально підійде для змагань та тренувань професійних райдерів. Купити рампу 2 м можна для відкритих скейтпарків, щоб залучити досвідчених спортсменів та створити справжню атмосферу екстриму.",
    //  description3: "комплекты для самостоятельного строительства элементов.",
    details: [
      { title: "kаталог фигур", link: "#catalog" },
      // { title: "Инструкции", link: "#instructions" },
      // { title: "Материалы", link: "#materials" },
      // { title: "Инструменты", link: "#tools" },
      // { title: "Советы", link: "#tips" }
    ],
    relatedProducts: [1, 2, 3] // IDs of related products
  }, 
]
export default productCatalogRamps